{"data":{"markdownRemark":{"html":"<p>For those that haven't heard the term digital nomad, it's an umbrella term to describe people who can work remotely , i.e., don't need to commute to an office and can do their jobs with a laptop with internet connection, and go travel around the world while doing that.</p>\n<p>I discovered this movement back in 2014 when I was an exchange student in Canada, and from there I started to dream about going nomadic myself. I started to research how I could use my skills to make money online, joined freelance platforms, and at the time I was decided to give a shot at creating custom WordPress themes. But circumstances changed.</p>\n<p>I landed a great internship with a company in Toronto. Luckily after the 4-month internship, and the end of my exchange in Canada, I was going back to back to Brazil with a full-time remote job. Cleary I dropped my initial plans, or better I didn't have to worry about how to make money online.</p>\n<p>Back home, the urge to go nomadic was still very alive, but I still had 1 and half years of university to attend before graduating, so had to wait before making the move. From time to time, on moments of procrastination or boredom, I'd started to frantically research about the digital nomad life and the destinations I'd like to travel to. Finally, a month or two before my graduation I made it real and bought a flight ticket to Europe - Prague was going to be the beginning of my nomadic journey.</p>\n<p>10 days after my graduation party I crossed the Atlantic for the first time and it all all began. In that first season, I spent 5 months abroad, going back to Brazil in January 2018.</p>\n<p>In June 2018 I took a flight to Europe again - season 2 was starting. It was much easier, I felt like a veteran, I knew how to do that \"digital nomad\" thing. I also know that being constantly in the look for the new destination, planing all the logistics, saying goodbyes, etc, brings anxiety and gets tiring. It's not the laptop in the beach photos that you see on Instagram.</p>\n<p>During that time, after 3 years working for the same company, even thought I could make my own schedule and fit it into my travels, the work was not motivating anymore and it started to feel like a burden, where I'd spend time working (heck, I am a professional and would do the job I was paid to), but not performing my best. Most of the other digital nomads who I met were building their own projects, which gave them purpose and (arguably) more freedom. My feeling was I was doing it without passion started to get tired of traveling.</p>\n<blockquote>\n<p>Okay, I also need to say that during this season I met a girl and fell in love with her.</p>\n</blockquote>\n<p>Season 2 ended in December 2018, I was back in Brazil and after too much thought, I decided to finally quit my job - back to square one. I didn't (and I don't) see myself settling in Brazil for the time being, so my options were to keep on going nomadic, or find a job abroad and emigrate.</p>\n<p>I opted for the latter and my motivation was:</p>\n<ul>\n<li>Being able to live in a country in Europe for more than 3 months. I guess I could apply for a \"self-employed/freelancer\" residence visa, but I'd need a business first.</li>\n<li>Be closer to my girlfriend. Although we'll end up not living together all the time, we'll be closer than Brazil and Europe.</li>\n<li>Grow up professionally. I learned a lot during my last job, but it slowed down too much at the end. Maybe it was related to working remotely, so I want to believe that working in an office will be good in this regard.</li>\n</ul>\n<p>It was not an easy decision! After years of no commutes to work, flexible working hours, and full-time travel, the change would be huge. It was scary.</p>\n<p>But here I am, living and working and settled in Amsterdam, The Netherlands.</p>\n<p>Can I say this is Season 3?</p>\n<hr>\n<p>PS: It's ironically that my first post on the subject of digital nomadism is about me going back to the \"normal life\". But fear nothing, I have many draft articles about my travels and all the amazing experiences, which as soon as I find time, i.e., stop watching too much Youtube videos, I'll be posting here.</p>","frontmatter":{"title":"My story as a digital nomad. Or why is it currently on pause?","date":"2014-07-17","date_formatted":"17 July, 2014"}}},"pageContext":{"slug":"/pausing-the-nomad-life/"}}