{"data":{"markdownRemark":{"html":"<p>For those that haven't heard the term digital nomad, it's an umbrella term to describe people who can work remotely, i.e., don't need to commute to an office, just need a laptop with an internet connection to do their jobs, and go travel around the world while doing such.</p>\n<p>I discovered this movement back in 2014 when I was an exchange student in Canada, and from there I started to dream about going nomadic myself. I started to research how I could use my skills to make money online, joined freelance platforms, and at the time I was decided to give a shot at creating custom WordPress themes. But circumstances changed.</p>\n<p>I landed a great internship with a company in Toronto and luckily after this internship and my exchange in Canada completed, I was going back to back to Brazil with a full-time remote job. Cleary I dropped my initial plans–or better, I didn't have to worry about how to make money online.</p>\n<p>Back home, the urge to go nomadic remained, but I still had one and a half year of university to attend before graduating, so I had to wait before making the move. From time to time, on moments of procrastination or boredom, I'd started to frantically research about the digital nomad life and the destinations I'd like to travel to. Finally, two months before my graduation I made it real and bought flight tickets to Europe – Prague was going to be the beginning of my nomadic journey.</p>\n<p>10 days after my graduation party I crossed the Atlantic for the first time and it all began. In that first season, I spent 5 months abroad, going back to Brazil in January 2018.</p>\n<p>In June 2018 I took a flight to Europe again – season 2 began. It was much easier, I felt like a veteran, I knew how to do the \"digital nomad\" thing. I also knew that being constantly in the look for the new destination, planing all the logistics, saying goodbyes, etc, brings anxiety and gets tiring. It's not the laptop in the beach photos that you see on Instagram.</p>\n<p>[insert funny laptop photo or my won workstation photo]</p>\n<p>By that time, more than 3 years of working for the same company have passed, and even though I could make my schedule and fit it into my travels, the work was not motivating anymore and I wasn't performing my best. Most of the other digital nomads whom I met were building their business projects, which gave them purpose and (arguably) more freedom. My feeling was that I was in it without passion.</p>\n<blockquote>\n<p>Okay, I also need to say that during this season I met a girl and fell in love with her.</p>\n</blockquote>\n<p>Season 2 ended in December 2018, I was back in Brazil and after too much thought, I decided to quit my job – back to square one. I didn't (and I don't) see myself settling in Brazil for the time being, so my options were to keep on going nomadic, or find a job abroad and emigrate.</p>\n<p>I opted for the latter and my motivation was:</p>\n<ul>\n<li>Being able to live in a country in Europe for more than 3 months. I guess I could apply for a \"self-employed/freelancer\" residence visa, but I'd need a business first.</li>\n<li>Being closer to my girlfriend. Did I say that I met a girl in Europe and fell in love?</li>\n<li>Resuming my professional growth. I believe a change in the atmosphere, the people and the problems I work with will be beneficial.</li>\n</ul>\n<p>It was not an easy decision! After years of no commutes to work, flexible working hours, and full-time travel, the change would be huge.</p>\n<p>It was scary.</p>\n<p>But here I am, working and settled in Amsterdam, The Netherlands.</p>\n<p>Can I say this is Season 3?</p>\n<hr>\n<p>PS: Ironically, my first post on the topic of digital nomadism is about me going back to the \"normal life\". But fear nothing, I have more draft articles on the subject and plan to publish them more often.</p>","frontmatter":{"title":"My story as a digital nomad. Or why is it currently on pause?","date":"2014-07-17","date_formatted":"17 July, 2014"}}},"pageContext":{"slug":"/my-story-as-a-digital-monad-is-on-pause/"}}